latex.org
#+TITLE:     ITL/LaTeX編
#+AUTHOR:    Takeshi Nagae
#+EMAIL:     nagae@m.tohoku.ac.jp
#+LANGUAGE:  ja
#+OPTIONS:   H:3 num:3 toc:2 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t author:t creator:t
#+OPTIONS:   TeX:t LaTeX:dvipng skip:nil d:nil todo:nil pri:nil tags:not-in-toc timestamp:t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:imagemagick
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD:<link rel=stylesheet href="style.css" type="text/css">
#+HTML_LINK_UP: https://nagae.github.io/itl
#+HTML_LINK_HOME: https://nagae.github.io
#+INFOJS_OPT: view:showall toc:t sdepth:2 ltoc:1 mouse:nil buttons:nil
#+LATEX_HEADER:\usepackage{amsmath,rmss_math,rmss_color}

* MacTeX のインストール
[[./homebrew.org][Homebrew]] で既にインストールされているはず．

* 日本語フォントの設定(ヒラギノフォントの埋め込みを可能に)
以下を *1行づつ順に* ターミナルで実行(=sudo= でパスワードを打つ必要があることに注意)
#+BEGIN_SRC sh
sudo tlmgr update --self --all
sudo tlmgr repository add http://contrib.texlive.info/current tlcontrib
sudo tlmgr pinning add tlcontrib '*'
sudo tlmgr install japanese-otf-nonfree japanese-otf-uptex-nonfree ptex-fontmaps-macos cjk-gs-integrate-macos
sudo cjk-gs-integrate --link-texmf --cleanup
curl -L -O https://raw.githubusercontent.com/texjporg/cjk-gs-support/master/cjk-gs-integrate-macos.pl
sudo perl cjk-gs-integrate-macos.pl --link-texmf
rm cjk-gs-integrate-macos.pl 
sudo mktexlsr
sudo kanji-config-updmap-sys --jis2004 hiragino-highsierra-pron
#+END_SRC

* COMMENT MacTeX のインストール
https://snap.textfile.org/20151006085255/

Homebrew がインストールされていることを前提に.

** brew-cask がインストールされていなければ インストールする
#+BEGIN_SRC sh
brew install caskroom/cask/brew-cask
#+END_SRC

** cask を使って MacTeX をインストール(時間がかかる)
#+BEGIN_SRC sh
brew update
brew cask install mactex
#+END_SRC

** TeX Live をアップデートする
古い TeX Live がインストールされている場合は, 以下を実行して古い
バージョンを退避させる(=20**= の部分は =2015, 2016= などに変更).
#+BEGIN_SRC sh
mv /usr/local/texlive/20**/ /usr/local/texlive/.20**
#+END_SRC

#+BEGIN_SRC sh
sudo tlmgr update --self --all --dry-run  # 何が起きるか心配な時はこちらを実行して何が起きるかを確認
sudo tlmgr update --self --all
#+END_SRC

** =TEXMFHOME= に =~/Dropbox/texmf= を設定
以下を実行する
#+BEGIN_SRC sh
sudo tlmgr conf texmf TEXMFHOME "~/Dropbox/texmf/"
#+END_SRC

** フォントの設定
- https://texwiki.texjp.org/?TeX%20Live%2FMac#elcapitan
- https://qiita.com/hideaki_polisci/items/3afd204449c6cdd995c9

以下のコマンドを1行づつ実行する:
#+BEGIN_SRC sh
sudo cjk-gs-integrate --link-texmf --force
sudo mktexlsr
sudo updmap-sys --setoption jaEmbed hiragino-elcapitan-pron
#+END_SRC

* COMMENT TeXLive 2014 のインストール
以下では， =texmf= ディレクトリを Dropbox 上に置く方法を示す．
** 参考
- TeX Live を使おう --- Linux ユーザと Mac OS X ユーザのために --- :: http://www.fugenji.org/~thomas/texlive-guide/
** 旧バージョンからのアップグレード
1. TeXLive 20** のバックアップ
   ** の部分はバックアップしたいバージョンに合わせて適宜変更(=2012, 2013= など)
   #+BEGIN_SRC sh
     mv /usr/local/texlive/20**/ /usr/local/texlive/.20**
   #+END_SRC
   
   TeXLive 2014 でうまく動かなくなったら，
   #+BEGIN_SRC sh
     mv /usr/local/texlive/2014 /usr/local/texlive/.2014
     mv /usr/local/texlive/.20** /usr/local/texlive/20**
     sed 's|/usr/local/texlive/2014|/usr/local/texlive/20**|g' ~/.bash_profile
     source ~/.bash_profile
     mktexlsr
   #+END_SRC
   とすれば TeXLive 20** に戻せるはず．
** 本体のインストール
1. インストーラをダウンロード

   長江研では =TEXMFHOME= を =~/Dropbox/texmf:/usr/local/share/texmf= とすることを推奨している．
   なお， =/usr/local/share/texmf= は後述する auctex で利用．
   #+BEGIN_SRC sh
     cd ~/Downloads
     curl -LO http://mirror.ctan.org/systems/texlive/tlnet/install-tl-unx.tar.gz 
     tar -xzf install-tl-unx.tar.gz
     cd install-tl* 
   #+END_SRC
2. インストーラを起動
   #+BEGIN_SRC sh
     sudo ./install-tl
   #+END_SRC
   
   設定画面で =TEXMFHOME= を =~/Dropbox/texmf:/usr/local/share/texmf= に変更．その方法は後述．

3. 不要なファイルを消去
   #+BEGIN_SRC sh
     cd ~/Downloads
     rm -rf install-tl*
   #+END_SRC

