latex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2017-10-06 Fri 08:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ITL/LaTeX編</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takeshi Nagae" />
<link rel=stylesheet href="style.css" type="text/css">


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://nagae.github.io/itl"> UP </a>
 |
 <a accesskey="H" href="https://nagae.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">ITL/LaTeX編</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc7b747e">1. MacTeX のインストール</a>
<ul>
<li><a href="#org0832788">1.1. brew-cask がインストールされていなければ インストールする</a></li>
<li><a href="#orgc809ec9">1.2. cask を使って MacTeX をインストール(時間がかかる)</a></li>
<li><a href="#orgf59cc4b">1.3. TeX Live をアップデートする</a></li>
<li><a href="#org7cf056d">1.4. <code>TEXMFHOME</code> に <code>~/Dropbox/texmf</code> を設定</a></li>
<li><a href="#orgc39ef60">1.5. フォントの設定</a></li>
</ul>
</li>
<li><a href="#orgb5adc00">2. TeXLive 2014 のインストール</a>
<ul>
<li><a href="#org2813e80">2.1. 参考</a></li>
<li><a href="#orgc0f4b66">2.2. 旧バージョンからのアップグレード</a></li>
<li><a href="#orgbade27b">2.3. 本体のインストール</a></li>
</ul>
</li>
<li><a href="#org1c7bc2e">3. パスの設定</a></li>
<li><a href="#org00c0927">4. 日本語フォントの設定(ヒラギノフォントの埋め込みを可能に)</a></li>
<li><a href="#org22f2788">5. コンパイルしてみる</a></li>
<li><a href="#org58dba75">6. tlmgr を使って常に最新の状態を保つ</a>
<ul>
<li><a href="#orgd916328">6.1. リポジトリを登録</a></li>
<li><a href="#org366971b">6.2. tlmgr 自身の更新</a></li>
</ul>
</li>
<li><a href="#orgaef30a1">7. latexmk</a></li>
<li><a href="#org9eb329a">8. 長江研標準 Tex ライブラリ</a></li>
<li><a href="#org13b10d3">9. Emacs との連携</a>
<ul>
<li><a href="#orgef7457e">9.1. auctex</a></li>
<li><a href="#org6f8244e">9.2. cdLaTeX</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc7b747e" class="outline-2">
<h2 id="orgc7b747e"><span class="section-number-2">1</span> MacTeX のインストール</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://snap.textfile.org/20151006085255/">https://snap.textfile.org/20151006085255/</a>
</p>

<p>
Homebrew がインストールされていることを前提に.
</p>
</div>

<div id="outline-container-org0832788" class="outline-3">
<h3 id="org0832788"><span class="section-number-3">1.1</span> brew-cask がインストールされていなければ インストールする</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">brew install caskroom/cask/brew-cask
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc809ec9" class="outline-3">
<h3 id="orgc809ec9"><span class="section-number-3">1.2</span> cask を使って MacTeX をインストール(時間がかかる)</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sh">brew update
brew cask install mactex
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf59cc4b" class="outline-3">
<h3 id="orgf59cc4b"><span class="section-number-3">1.3</span> TeX Live をアップデートする</h3>
<div class="outline-text-3" id="text-1-3">
<p>
古い TeX Live がインストールされている場合は, 以下を実行して古い
バージョンを退避させる(<code>20**</code> の部分は <code>2015, 2016</code> などに変更).
</p>
<div class="org-src-container">
<pre class="src src-sh">mv /usr/local/texlive/20**/ /usr/local/texlive/.20**
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">sudo tlmgr update --self --all --dry-run  <span style="color: #00cd66;"># </span><span style="color: #00cd66;">&#20309;&#12364;&#36215;&#12365;&#12427;&#12363;&#24515;&#37197;&#12394;&#26178;&#12399;&#12371;&#12385;&#12425;&#12434;&#23455;&#34892;&#12375;&#12390;&#20309;&#12364;&#36215;&#12365;&#12427;&#12363;&#12434;&#30906;&#35469;</span>
sudo tlmgr update --self --all
</pre>
</div>
</div>
</div>

<div id="outline-container-org7cf056d" class="outline-3">
<h3 id="org7cf056d"><span class="section-number-3">1.4</span> <code>TEXMFHOME</code> に <code>~/Dropbox/texmf</code> を設定</h3>
<div class="outline-text-3" id="text-1-4">
<p>
以下を実行する
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo tlmgr conf texmf TEXMFHOME <span style="color: #bdb76b;">"~/Dropbox/texmf/"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc39ef60" class="outline-3">
<h3 id="orgc39ef60"><span class="section-number-3">1.5</span> フォントの設定</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://texwiki.texjp.org/?TeX%20Live/Mac#elcapitan">https://texwiki.texjp.org/?TeX Live/Mac#elcapitan</a></li>
<li><a href="https://qiita.com/hideaki_polisci/items/3afd204449c6cdd995c9">https://qiita.com/hideaki_polisci/items/3afd204449c6cdd995c9</a></li>
</ul>

<p>
以下のコマンドを1行づつ実行する:
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo cjk-gs-integrate --link-texmf --force
sudo mktexlsr
sudo updmap-sys --setoption jaEmbed hiragino-elcapitan-pron
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb5adc00" class="outline-2">
<h2 id="orgb5adc00"><span class="section-number-2">2</span> TeXLive 2014 のインストール</h2>
<div class="outline-text-2" id="text-2">
<p>
以下では， <code>texmf</code> ディレクトリを Dropbox 上に置く方法を示す．
</p>
</div>
<div id="outline-container-org2813e80" class="outline-3">
<h3 id="org2813e80"><span class="section-number-3">2.1</span> 参考</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>TeX Live を使おう &#x2014; Linux ユーザと Mac OS X ユーザのために ---</dt><dd><a href="http://www.fugenji.org/~thomas/texlive-guide/">http://www.fugenji.org/~thomas/texlive-guide/</a></dd>
</dl>
</div>
</div>
<div id="outline-container-orgc0f4b66" class="outline-3">
<h3 id="orgc0f4b66"><span class="section-number-3">2.2</span> 旧バージョンからのアップグレード</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><p>
TeXLive 20** のバックアップ
** の部分はバックアップしたいバージョンに合わせて適宜変更(<code>2012, 2013</code> など)
</p>
<div class="org-src-container">
<pre class="src src-sh">mv /usr/local/texlive/20**/ /usr/local/texlive/.20**
</pre>
</div>

<p>
TeXLive 2014 でうまく動かなくなったら，
</p>
<div class="org-src-container">
<pre class="src src-sh">mv /usr/local/texlive/2014 /usr/local/texlive/.2014
mv /usr/local/texlive/.20** /usr/local/texlive/20**
sed <span style="color: #bdb76b;">'s|/usr/local/texlive/2014|/usr/local/texlive/20**|g'</span> ~/.bash_profile
<span style="color: #b0c4de;">source</span> ~/.bash_profile
mktexlsr
</pre>
</div>
<p>
とすれば TeXLive 20** に戻せるはず．
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgbade27b" class="outline-3">
<h3 id="orgbade27b"><span class="section-number-3">2.3</span> 本体のインストール</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><p>
インストーラをダウンロード
</p>

<p>
長江研では <code>TEXMFHOME</code> を <code>~/Dropbox/texmf:/usr/local/share/texmf</code> とすることを推奨している．
なお， <code>/usr/local/share/texmf</code> は後述する auctex で利用．
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> ~/Downloads
curl -LO http://mirror.ctan.org/systems/texlive/tlnet/install-tl-unx.tar.gz 
tar -xzf install-tl-unx.tar.gz
<span style="color: #b0c4de;">cd</span> install-tl*
</pre>
</div></li>
<li><p>
インストーラを起動
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo ./install-tl
</pre>
</div>

<p>
設定画面で <code>TEXMFHOME</code> を <code>~/Dropbox/texmf:/usr/local/share/texmf</code> に変更．その方法は後述．
</p></li>

<li><p>
不要なファイルを消去
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> ~/Downloads
rm -rf install-tl*
</pre>
</div></li>
</ol>
</div>
