latex.org
*** =install-tl= で =TEXMFHOME= を =~/Dropbox/texmf= に変更する方法
1. 下記の main manu で =Enter command:= の後に =D RET= を入力(ディレクトリ)：
  #+BEGIN_SRC screen
    ======================> TeX Live installation procedure <=====================
       
    =======> Note: Letters/digits in <angle brackets> indicate menu items <=======
    =======>       for commands or configurable options                   <=======
       
     Detected platform: universal binaries for MacOSX/Darwin
    
     <B> platforms: 1 out of 18
       
     <S> installation scheme (scheme-full)
         84 collections out of 85, disk space required: 3889 MB
       
     Customizing installation scheme:
       <C> standard collections
       <L> language collections
       
     <D> directories:
       TEXDIR (the main TeX directory):
    (省略)
    Actions:
     <I> start installation to hard disk
     <H> help
     <Q> quit
    
    Enter command: 
 #+END_SRC

2. 下記の Directories setup メニューで =Enter command:= の後に =7 RET= と入力
   (=TEXMFHOME= の設定)
   #+BEGIN_SRC screen
     ===============================================================================
     Directories setup:
     
      <1> TEXDIR:       /usr/local/texlive/2013
          support tree: /usr/local/texlive/2013/texmf
      <2> TEXMFLOCAL:     /usr/local/texlive/texmf-local
      <3> TEXMFSYSVAR:    /usr/local/texlive/2013/texmf-var
      <4> TEXMFSYSCONFIG: /usr/local/texlive/2013/texmf-config
     
      <5> TEXMFVAR:       ~/.texlive2013/texmf-var
      <6> TEXMFCONFIG:    ~/.texlive2013/texmf-config
      <7> TEXMFHOME:      ~/texmf
     
      Note: ~ will expand to $HOME (or to %USERPROFILE% on Windows)
     
     Actions:
      <R> return to main menu
      <Q> quit
     
     Enter command: 
   #+END_SRC

3. 下記のように新しい =TEXMFHOME= ディレクトリを訊かれるので =~/Dropbox/texmf:/usr/local/share/texmf= と入力して return：
   #+BEGIN_SRC screen
     New value for TEXMFHOME [~/texmf]: 
   #+END_SRC
   
4. Directory setup の表示の =TEXMFHOME= の部分が下記のように変わったことを確認し
   たら =r RET= と入力して main menu に戻る．
   #+BEGIN_SRC screen
     (省略)
     <6> TEXMFCONFIG:    ~/.texlive2013/texmf-config
     <7> TEXMFHOME:      ~/Dropbox/texmf:/usr/local/share/texmf
     
      Note: ~ will expand to $HOME (or to %USERPROFILE% on Windows)
     (省略)
   #+END_SRC

5. main menu で下記のように表示されたら =i RET= としてインストールを開始する
   #+BEGIN_SRC screen
     ======================> TeX Live installation procedure <=====================
     
     =======> Note: Letters/digits in <angle brackets> indicate menu items <=======
     =======>       for commands or configurable options                   <=======
     
     (省略)
     
      <D> directories:
      (省略)
        TEXMFHOME (directory for user-specific files):
          ~/Dropbox/texmf:/usr/local/share/texmf
     
     (省略)
     
     Actions:
      <I> start installation to hard disk
      <H> help
      <Q> quit
   #+END_SRC

*** インストールした後で TEXMFHOME を修正したい場合
=tlmgr= でも変更できる． 
#+BEGIN_SRC sh
sudo tlmgr conf texmf TEXMFHOME ~/Dropbox/texmf:/usr/local/share/texmf
#+END_SRC

* COMMENT パスの設定
6. TeX フォルダパスの設定
   =~/.bash_profile= に以下を追記：
   #+BEGIN_SRC sh
     export PATH=/usr/local/texlive/2016/bin/x86_64-darwin:$PATH
     export MANPATH=/usr/local/texlive/2016/texmf/doc/man:$MANPATH
     export INFOPATH=/usr/local/texlive/2016/texmf-dist/doc/info:$INFOPATH
   #+END_SRC

   TeXLive 2015 で既に =PATH= などを設定済みなら，ターミナルから以下を実行すればよ
   い．
   #+BEGIN_SRC sh
   sed 's|/usr/local/texlive/2015|/usr/local/texlive/2016|g' ~/.bash_profile
   #+END_SRC

7. パスを反映
   どのフォルダでも構わないのでターミナルから以下を実行：
   #+BEGIN_SRC screen
   source ~/.bash_profile
   #+END_SRC
* COMMENT 日本語フォントの設定(ヒラギノフォントの埋め込みを可能に)
ターミナルから以下のコマンドを *一行ずつ* 入力して実行:
#+BEGIN_SRC sh
cd /usr/local/texlive/2016/texmf-dist/scripts/cjk-gs-integrate
sudo perl cjk-gs-integrate.pl --link-texmf --force
sudo mktexlsr
sudo kanji-config-updmap-sys hiragino-elcapitan-pron
#+END_SRC

* COMMENT otf パッケージ用のフォントの設定
TexLive 2013 からは =/usr/local/texlive/20**/texmf-dist/fonts/map/dvipdfmx/jfontmaps/= 以下に日本語フォントマップが入っている．
Mac OS X 用には =hiragino/otf-hiragino.map= あたりが使える(参照：http://www.fugenji.org/~thomas/texlive-guide/font_setup.html)
1. ヒラギノフォントにシンボリックリンクを貼る：
   #+BEGIN_SRC sh
     mkdir -p /usr/local/texlive/texmf-local/fonts/opentype/public/hiragino/
     cd /usr/local/texlive/texmf-local/fonts/opentype/public/hiragino/
     ln -fs "/Library/Fonts/ヒラギノ明朝 Pro W3.otf" ./HiraMinPro-W3.otf
     ln -fs "/Library/Fonts/ヒラギノ明朝 Pro W6.otf" ./HiraMinPro-W6.otf
     ln -fs "/Library/Fonts/ヒラギノ丸ゴ Pro W4.otf" ./HiraMaruPro-W4.otf
     ln -fs "/Library/Fonts/ヒラギノ角ゴ Pro W3.otf" ./HiraKakuPro-W3.otf
     ln -fs "/Library/Fonts/ヒラギノ角ゴ Pro W6.otf" ./HiraKakuPro-W6.otf
     ln -fs "/Library/Fonts/ヒラギノ角ゴ Std W8.otf" ./HiraKakuStd-W8.otf
   #+END_SRC
2. Tex用のパスを更新：
   どのフォルダからでも構わないのでターミナルから以下を実行：
   #+BEGIN_SRC sh
   mktexlsr
   #+END_SRC
3. デフォルトのフォントマップを =otf-hiragino= にする
   #+BEGIN_SRC sh
   kanji-config-updmap hiragino
   #+END_SRC
* コンパイルしてみる
以下をターミナルから実行してみる
#+BEGIN_SRC sh
  mkdir -p ~/Downloads/sampletex
  cd ~/Downloads/sampletex
  curl -O https://gist.githubusercontent.com/nagae/1350983/raw/sample.tex
  platex sample.tex 
  dvipdfmx -o sample.pdf sample
  open sample.pdf
#+END_SRC
* tlmgr を使って常に最新の状態を保つ
上述の方法によって tlmgr もインストールされる．これを使えば，TeX を常に最新の状態に保てる．
** リポジトリを登録
tlmgr が参照するリポジトリに =mirror.ctan.org= を指定しておく([[http://www.fugenji.org/~thomas/texlive-guide/tlmgr.html][参考]])．この操作は初回に一度行えばよい．
#+BEGIN_SRC sh
sudo tlmgr option repository http://mirror.ctan.org/systems/texlive/tlnet
#+END_SRC
** tlmgr 自身の更新
- tlmgr 自身とシステムを同時に更新
  #+BEGIN_SRC sh
  sudo tlmgr update --self --all
  #+END_SRC
*** 知られている問題：
- 2013年9月頃 =Unknown docfile tag:=
  #+BEGIN_SRC sh
    Unknown docfile tag:  texmf-dist/doc/latex/pythontex/pythontex_quickstart.pdf details=""Quick start" documentation" at /usr/local/texlive/2013/tlpkg/TeXLive/TLPOBJ.pm line 127
  #+END_SRC
  というメッセージが出て止まる場合の対処法は http://tex.stackexchange.com/a/133690/36810
* latexmk
latexmk は TeX の処理を自動化してくれるスクリプト．
設定を =~/.latexmkrc= に記載しておくと，ターミナルから =latexmk= を呼ぶだけで色々な処理をしてくれる．
例えば，以下のように =~/.latexmkrc= に書いておく，
#+HTML: <script src="https://gist.github.com/nagae/5290992.js"></script>
もしくは，ターミナルから
#+BEGIN_SRC sh
cd ~/
curl -LO curl -LO https://gist.github.com/nagae/3293112/raw/.latexmkrc
#+END_SRC
としておくと，
#+BEGIN_SRC sh
$ latexmk sample.tex
#+END_SRC
とするだけで =platex= → =pbitex= → =platex= → =dvipdfmx= と処理を続けて pdf を作成してくれる．さらに，
#+BEGIN_SRC sh
$ latexmk -pv sample.tex
#+END_SRC
とすれば，その pdf ファイルを Preview.app で開いてくれる．

