latex.html

<div id="outline-container-orgdc9042c" class="outline-4">
<h4 id="orgdc9042c"><span class="section-number-4">2.3.1</span> <code>install-tl</code> で <code>TEXMFHOME</code> を <code>~/Dropbox/texmf</code> に変更する方法</h4>
<div class="outline-text-4" id="text-2-3-1">
<ol class="org-ol">
<li><p>
下記の main manu で <code>Enter command:</code> の後に <code>D RET</code> を入力(ディレクトリ)：
</p>
<div class="org-src-container">
<pre class="src src-screen">======================&gt; TeX Live installation procedure &lt;=====================

=======&gt; Note: Letters/digits<span style="color: #ffffff;"> in</span> &lt;angle brackets&gt; indicate menu items &lt;=======
=======&gt;       for commands or configurable options                   &lt;=======

 Detected platform: universal binaries for MacOSX/Darwin

 &lt;B&gt; platforms: 1 out of 18

 &lt;S&gt; installation scheme (scheme-full)
     84 collections out of 85, disk space required: 3889 MB

 Customizing installation scheme:
   &lt;C&gt; standard collections
   &lt;L&gt; language collections

 &lt;D&gt; directories:
   TEXDIR (the main TeX directory):
(&#30465;&#30053;)
Actions:
 &lt;I&gt; start installation to hard disk
 &lt;H&gt; help
 &lt;Q&gt; quit

Enter command:
</pre>
</div></li>

<li><p>
下記の Directories setup メニューで <code>Enter command:</code> の後に <code>7 RET</code> と入力
(<code>TEXMFHOME</code> の設定)
</p>
<div class="org-src-container">
<pre class="src src-screen">===============================================================================
Directories setup:

 &lt;1&gt; TEXDIR:       /usr/local/texlive/2013
     support tree: /usr/local/texlive/2013/texmf
 &lt;2&gt; TEXMFLOCAL:     /usr/local/texlive/texmf-local
 &lt;3&gt; TEXMFSYSVAR:    /usr/local/texlive/2013/texmf-var
 &lt;4&gt; TEXMFSYSCONFIG: /usr/local/texlive/2013/texmf-config

 &lt;5&gt; TEXMFVAR:       ~/.texlive2013/texmf-var
 &lt;6&gt; TEXMFCONFIG:    ~/.texlive2013/texmf-config
 &lt;7&gt; TEXMFHOME:      ~/texmf

 Note: ~ will expand to $<span style="color: #9acd32;">HOME</span> (or to %USERPROFILE% on Windows)

Actions:
 &lt;R&gt; return to main menu
 &lt;Q&gt; quit

Enter command:
</pre>
</div></li>

<li><p>
下記のように新しい <code>TEXMFHOME</code> ディレクトリを訊かれるので <code>~/Dropbox/texmf:/usr/local/share/texmf</code> と入力して return：
</p>
<div class="org-src-container">
<pre class="src src-screen">New value for TEXMFHOME [~/texmf]:
</pre>
</div></li>

<li><p>
Directory setup の表示の <code>TEXMFHOME</code> の部分が下記のように変わったことを確認し
たら <code>r RET</code> と入力して main menu に戻る．
</p>
<div class="org-src-container">
<pre class="src src-screen">(&#30465;&#30053;)
&lt;6&gt; TEXMFCONFIG:    ~/.texlive2013/texmf-config
&lt;7&gt; TEXMFHOME:      ~/Dropbox/texmf:/usr/local/share/texmf

 Note: ~ will expand to $<span style="color: #9acd32;">HOME</span> (or to %USERPROFILE% on Windows)
(&#30465;&#30053;)
</pre>
</div></li>

<li><p>
main menu で下記のように表示されたら <code>i RET</code> としてインストールを開始する
</p>
<div class="org-src-container">
<pre class="src src-screen">======================&gt; TeX Live installation procedure &lt;=====================

=======&gt; Note: Letters/digits<span style="color: #ffffff;"> in</span> &lt;angle brackets&gt; indicate menu items &lt;=======
=======&gt;       for commands or configurable options                   &lt;=======

(&#30465;&#30053;)

 &lt;D&gt; directories:
 (&#30465;&#30053;)
   TEXMFHOME (directory for user-specific files):
     ~/Dropbox/texmf:/usr/local/share/texmf

(&#30465;&#30053;)

Actions:
 &lt;I&gt; start installation to hard disk
 &lt;H&gt; help
 &lt;Q&gt; quit
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org193939c" class="outline-4">
<h4 id="org193939c"><span class="section-number-4">2.3.2</span> インストールした後で TEXMFHOME を修正したい場合</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<code>tlmgr</code> でも変更できる． 
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo tlmgr conf texmf TEXMFHOME ~/Dropbox/texmf:/usr/local/share/texmf
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org1c7bc2e" class="outline-2">
<h2 id="org1c7bc2e"><span class="section-number-2">3</span> パスの設定</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><p>
TeX フォルダパスの設定
<code>~/.bash_profile</code> に以下を追記：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">export</span> <span style="color: #9acd32;">PATH</span>=/usr/local/texlive/2016/bin/x86_64-darwin:$<span style="color: #9acd32;">PATH</span>
<span style="color: #b0c4de;">export</span> <span style="color: #9acd32;">MANPATH</span>=/usr/local/texlive/2016/texmf/doc/man:$<span style="color: #9acd32;">MANPATH</span>
<span style="color: #b0c4de;">export</span> <span style="color: #9acd32;">INFOPATH</span>=/usr/local/texlive/2016/texmf-dist/doc/info:$<span style="color: #9acd32;">INFOPATH</span>
</pre>
</div>

<p>
TeXLive 2015 で既に <code>PATH</code> などを設定済みなら，ターミナルから以下を実行すればよ
い．
</p>
<div class="org-src-container">
<pre class="src src-sh">sed <span style="color: #bdb76b;">'s|/usr/local/texlive/2015|/usr/local/texlive/2016|g'</span> ~/.bash_profile
</pre>
</div></li>

<li><p>
パスを反映
どのフォルダでも構わないのでターミナルから以下を実行：
</p>
<div class="org-src-container">
<pre class="src src-screen"><span style="color: #b0c4de;">source</span> ~/.bash_profile
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-org00c0927" class="outline-2">
<h2 id="org00c0927"><span class="section-number-2">4</span> 日本語フォントの設定(ヒラギノフォントの埋め込みを可能に)</h2>
<div class="outline-text-2" id="text-4">
<p>
ターミナルから以下のコマンドを <b>一行ずつ</b> 入力して実行:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> /usr/local/texlive/2016/texmf-dist/scripts/cjk-gs-integrate
sudo perl cjk-gs-integrate.pl --link-texmf --force
sudo mktexlsr
sudo kanji-config-updmap-sys hiragino-elcapitan-pron
</pre>
</div>
</div>
</div>

<div id="outline-container-org22f2788" class="outline-2">
<h2 id="org22f2788"><span class="section-number-2">5</span> コンパイルしてみる</h2>
<div class="outline-text-2" id="text-5">
<p>
以下をターミナルから実行してみる
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir -p ~/Downloads/sampletex
<span style="color: #b0c4de;">cd</span> ~/Downloads/sampletex
curl -O https://gist.githubusercontent.com/nagae/1350983/raw/sample.tex
platex sample.tex 
dvipdfmx -o sample.pdf sample
open sample.pdf
</pre>
</div>
</div>
</div>
<div id="outline-container-org58dba75" class="outline-2">
<h2 id="org58dba75"><span class="section-number-2">6</span> tlmgr を使って常に最新の状態を保つ</h2>
<div class="outline-text-2" id="text-6">
<p>
上述の方法によって tlmgr もインストールされる．これを使えば，TeX を常に最新の状態に保てる．
</p>
</div>
<div id="outline-container-orgd916328" class="outline-3">
<h3 id="orgd916328"><span class="section-number-3">6.1</span> リポジトリを登録</h3>
<div class="outline-text-3" id="text-6-1">
<p>
tlmgr が参照するリポジトリに <code>mirror.ctan.org</code> を指定しておく(<a href="http://www.fugenji.org/~thomas/texlive-guide/tlmgr.html">参考</a>)．この操作は初回に一度行えばよい．
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo tlmgr option repository http://mirror.ctan.org/systems/texlive/tlnet
</pre>
</div>
</div>
</div>
<div id="outline-container-org366971b" class="outline-3">
<h3 id="org366971b"><span class="section-number-3">6.2</span> tlmgr 自身の更新</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><p>
tlmgr 自身とシステムを同時に更新
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo tlmgr update --self --all
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-org451d6b2" class="outline-4">
<h4 id="org451d6b2"><span class="section-number-4">6.2.1</span> 知られている問題：</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><p>
2013年9月頃 <code>Unknown docfile tag:</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">Unknown docfile tag:  texmf-dist/doc/latex/pythontex/pythontex_quickstart.pdf <span style="color: #9acd32;">details</span>=<span style="color: #bdb76b;">""</span>Quick start<span style="color: #bdb76b;">" documentation"</span> at /usr/local/texlive/2013/tlpkg/TeXLive/TLPOBJ.pm line 127
</pre>
</div>
<p>
というメッセージが出て止まる場合の対処法は <a href="http://tex.stackexchange.com/a/133690/36810">http://tex.stackexchange.com/a/133690/36810</a>
</p></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaef30a1" class="outline-2">
<h2 id="orgaef30a1"><span class="section-number-2">7</span> latexmk</h2>
<div class="outline-text-2" id="text-7">
<p>
latexmk は TeX の処理を自動化してくれるスクリプト．
設定を <code>~/.latexmkrc</code> に記載しておくと，ターミナルから <code>latexmk</code> を呼ぶだけで色々な処理をしてくれる．
例えば，以下のように <code>~/.latexmkrc</code> に書いておく，
</p>
<script src="https://gist.github.com/nagae/5290992.js"></script>
<p>
もしくは，ターミナルから
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> ~/
curl -LO curl -LO https://gist.github.com/nagae/3293112/raw/.latexmkrc
</pre>
</div>
<p>
としておくと，
</p>
<div class="org-src-container">
<pre class="src src-sh">$ latexmk sample.tex
</pre>
</div>
<p>
とするだけで <code>platex</code> → <code>pbitex</code> → <code>platex</code> → <code>dvipdfmx</code> と処理を続けて pdf を作成してくれる．さらに，
</p>
<div class="org-src-container">
<pre class="src src-sh">$ latexmk -pv sample.tex
</pre>
</div>
<p>
とすれば，その pdf ファイルを Preview.app で開いてくれる．
</p>
</div>
</div>
