latex.org
* 長江研標準 Tex ライブラリ
長江研ではユーザー個別の TeX ライブラリの置き場 =TEXMFHOME= として
=~/Dropbox/texmf/tex= を用いる．
- 使い方は http://github.com/nagae/texmf から．
* Emacs との連携
Emacs 上でのLaTeX ソースの編集に支援ツールは必須
** auctex
*** 特徴
Emacs 上での LaTeX 編集を支援．C-c C-c で compile したり，C-c C-p C-d で preview 見たりできる．
*** 参考
- 公式サイト :: http://www.gnu.org/software/auctex/
- EmacsWiki :: http://emacswiki.org/emacs/AUCTeX
- 奥村先生 :: http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?AUCTeX
*** インストール
- ELPA からインストール可能
- Emacs を立ち上げ，以下を入力して RET
  #+BEGIN_SRC example
  M-x package-install auctex
  #+END_SRC
*** 使い方
**** 章・節，環境，マクロの入力
- TABで補完が可能．
- カーソルの上下(もしくは =M-p, M-n=)で履歴を選択可能．
#+ATTR_HTML: border=2 rules="all"
| ショートカット           | 機能                                                   |
|--------------------------+--------------------------------------------------------|
| =C-c C-s=                | 章(=chapter=)，節(=section=)，小節(=subsection=)を入力 |
| =C-c C-e=                | 環境(=\begin{}...\end{}=)を入力                        |
| =C-c C-m= もしくは =C-c RET= | マクロ(eg. =\ret{}, \centering{}=)を挿入               |
**** フォント変更
- 何も選択せずにショートカットを入力すると LaTeX コマンドだけを入力し，括弧内で待機
- 文字列を選択してショートカットを入力すると，当該文字を LaTeX コマンド内に内挿
#+ATTR_HTML: border=2 rules="all"
| ショートカット | 機能                                                                          |
|----------------+-------------------------------------------------------------------------------|
| =C-c C-f C-b=   | 太字 =\textbf{*}=                                                             |
| =C-c C-f C-i=   | イタリック =\textit{*}=                                                       |
| =C-c C-f C-e=   | 強調 =\emph{*}=                                                               |
| =C-c C-f C-s=   | 斜体 =\textsl{*}=                                                             |
| =C-c C-f C-r=   | ローマン =\textrm{*}=                                                         |
| =C-c C-f C-f=   | サンセリフ．修飾の無い(Sans-serif)=ゴシック体 =\textsf{*}=                    |
| =C-c C-f C-t=   | タイプライター =\texttt{*}=                                                   |
| =C-c C-f C-c=   | スモールキャピタル(Small cap.)．小文字を「小さい大文字」で表記． =\textsc{*}= |
| =C-c C-f C-d=  | フォント修飾を削除                                                            |
**** コメント
#+ATTR_HTML: border=2 rules="all"
| ショートカット | 機能                               |
|----------------+------------------------------------|
| =C-c ;=        | 選択したリージョンをコメントアウト |
| =C-c %=        | 現在の段落をコメントアウト         |
**** マーク
#+ATTR_HTML: border=2 rules="all"
| ショートカット | 機能                     |
|----------------+--------------------------|
| =C-c *=        | 現在のセクションをマーク |
| =C-c .=        | 現在の環境をマーク       |
**** 処理
処理コマンドは TAB補完および上下(=M-p, M-n=)履歴表示が可能
#+ATTR_HTML: border=2 rules="all"
| ショートカット | 機能                           |
|----------------+----------------------------------|
| =C-c C-c=      | 文章全体を処理(※)               |
| =C-c C-r=      | 選択したリージョンのみを処理(※) |
| =C-c C-b=      | 現在のバッファのみを処理(※)     |
|----------------+----------------------------------|
| =C-c '=        | エラーを表示                     |
| =C-x '=        | 次のエラーを表示                 |
| =C-u C-x '=    | 前のエラーを表示                 |

※長江研の設定では， =C-c C-c=, =C-c C-r=, =C-c C-b= に続く処理コマンドとして(デフォルトで実装されているものも含め)以下が用意されている：
#+BEGIN_EXAMPLE
BibTeX 	Biber 	Check 	Clean 	Clean All 	File 	Index
LaTeX 	Other 	Print 	Queue 	Spell 	View 	direct
dvipdfmx 	latexmk 	pBibTeX 	pLaTeX
#+END_EXAMPLE
このうち，頻繁に使うのは以下のコマンドである．いずれもタブ補完が可能：
#+ATTR_HTML: border="2" rules="all"
|-----------+----------------------------------------------------------------------------------------------|
| コマンド  | 処理内容                                                                                     |
|-----------+----------------------------------------------------------------------------------------------|
| pLaTeX    | pLaTeX を実行(.tex → .dvi)                                                                  |
| pBibTeX   | pBibTeX を実行(.aux ファイルを元に .bbl を生成)                                              |
| dvipdfmx  | dvipdfmx を実行(.dvi → .pdf)                                                                |
| latexmk   | latexmk を実行(=~/.latexmkrc= で処理内容を設定可能)                                          |
| View      | (=open foo.pdf= などを呼び出せる)                                                            |
| Other     | 任意のコマンドを実行(e.g. =open -a Preview foo.pdf= などを呼び出せる)                        |
| direct    | TeX ファイルを処理した後，PDF ファイルを開く(latexmk の後， =open -a Preview foo.pdf= を実行) |
| Check     | lacheck による文法チェック                                                                   |
| Clean     | TeX 処理時に生成される中間ファイル(.aux, .toc, .log, .bbl など)を削除                        |
| Clean All | 上記中間ファイルに加えて .dvi, .ps, .pdf などのファイルも削除                                |
| Spell     | スペルチェック                                                                               |
|-----------+----------------------------------------------------------------------------------------------|

