latex.html

<div id="outline-container-org9eb329a" class="outline-2">
<h2 id="org9eb329a"><span class="section-number-2">8</span> 長江研標準 Tex ライブラリ</h2>
<div class="outline-text-2" id="text-8">
<p>
長江研ではユーザー個別の TeX ライブラリの置き場 <code>TEXMFHOME</code> として
<code>~/Dropbox/texmf/tex</code> を用いる．
</p>
<ul class="org-ul">
<li>使い方は <a href="http://github.com/nagae/texmf">http://github.com/nagae/texmf</a> から．</li>
</ul>
</div>
</div>
<div id="outline-container-org13b10d3" class="outline-2">
<h2 id="org13b10d3"><span class="section-number-2">9</span> Emacs との連携</h2>
<div class="outline-text-2" id="text-9">
<p>
Emacs 上でのLaTeX ソースの編集に支援ツールは必須
</p>
</div>
<div id="outline-container-orgef7457e" class="outline-3">
<h3 id="orgef7457e"><span class="section-number-3">9.1</span> auctex</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-orgd0d8b26" class="outline-4">
<h4 id="orgd0d8b26"><span class="section-number-4">9.1.1</span> 特徴</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Emacs 上での LaTeX 編集を支援．C-c C-c で compile したり，C-c C-p C-d で preview 見たりできる．
</p>
</div>
</div>
<div id="outline-container-org258274c" class="outline-4">
<h4 id="org258274c"><span class="section-number-4">9.1.2</span> 参考</h4>
<div class="outline-text-4" id="text-9-1-2">
<dl class="org-dl">
<dt>公式サイト</dt><dd><a href="http://www.gnu.org/software/auctex/">http://www.gnu.org/software/auctex/</a></dd>
<dt>EmacsWiki</dt><dd><a href="http://emacswiki.org/emacs/AUCTeX">http://emacswiki.org/emacs/AUCTeX</a></dd>
<dt>奥村先生</dt><dd><a href="http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?AUCTeX">http://oku.edu.mie-u.ac.jp/~okumura/texwiki/?AUCTeX</a></dd>
</dl>
</div>
</div>
<div id="outline-container-org4215d53" class="outline-4">
<h4 id="org4215d53"><span class="section-number-4">9.1.3</span> インストール</h4>
<div class="outline-text-4" id="text-9-1-3">
<ul class="org-ul">
<li>ELPA からインストール可能</li>
<li><p>
Emacs を立ち上げ，以下を入力して RET
</p>
<div class="org-src-container">
<pre class="src src-example">M-x package-install auctex
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgf4d7142" class="outline-4">
<h4 id="orgf4d7142"><span class="section-number-4">9.1.4</span> 使い方</h4>
<div class="outline-text-4" id="text-9-1-4">
</div><ul class="org-ul"><li><a id="orgca310e6"></a>章・節，環境，マクロの入力<br /><div class="outline-text-5" id="text-orgca310e6">
<ul class="org-ul">
<li>TABで補完が可能．</li>
<li>カーソルの上下(もしくは <code>M-p, M-n</code>)で履歴を選択可能．</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ショートカット</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-s</code></td>
<td class="org-left">章(<code>chapter</code>)，節(<code>section</code>)，小節(<code>subsection</code>)を入力</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-e</code></td>
<td class="org-left">環境(<code>\begin{}...\end{}</code>)を入力</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-m</code> もしくは <code>C-c RET</code></td>
<td class="org-left">マクロ(eg. <code>\ret{}, \centering{}</code>)を挿入</td>
</tr>
</tbody>
</table>
</div></li>
<li><a id="orgbe4ef97"></a>フォント変更<br /><div class="outline-text-5" id="text-orgbe4ef97">
<ul class="org-ul">
<li>何も選択せずにショートカットを入力すると LaTeX コマンドだけを入力し，括弧内で待機</li>
<li>文字列を選択してショートカットを入力すると，当該文字を LaTeX コマンド内に内挿</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ショートカット</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-f C-b</code></td>
<td class="org-left">太字 <code>\textbf{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-i</code></td>
<td class="org-left">イタリック <code>\textit{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-e</code></td>
<td class="org-left">強調 <code>\emph{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-s</code></td>
<td class="org-left">斜体 <code>\textsl{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-r</code></td>
<td class="org-left">ローマン <code>\textrm{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-f</code></td>
<td class="org-left">サンセリフ．修飾の無い(Sans-serif)=ゴシック体 <code>\textsf{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-t</code></td>
<td class="org-left">タイプライター <code>\texttt{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-c</code></td>
<td class="org-left">スモールキャピタル(Small cap.)．小文字を「小さい大文字」で表記． <code>\textsc{*}</code></td>
</tr>

<tr>
<td class="org-left"><code>C-c C-f C-d</code></td>
<td class="org-left">フォント修飾を削除</td>
</tr>
</tbody>
</table>
</div></li>
<li><a id="org1856aed"></a>コメント<br /><div class="outline-text-5" id="text-org1856aed">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ショートカット</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c ;</code></td>
<td class="org-left">選択したリージョンをコメントアウト</td>
</tr>

<tr>
<td class="org-left"><code>C-c %</code></td>
<td class="org-left">現在の段落をコメントアウト</td>
</tr>
</tbody>
</table>
</div></li>
<li><a id="orgbd531f5"></a>マーク<br /><div class="outline-text-5" id="text-orgbd531f5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ショートカット</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c *</code></td>
<td class="org-left">現在のセクションをマーク</td>
</tr>

<tr>
<td class="org-left"><code>C-c .</code></td>
<td class="org-left">現在の環境をマーク</td>
</tr>
</tbody>
</table>
</div></li>
<li><a id="org7645ea4"></a>処理<br /><div class="outline-text-5" id="text-org7645ea4">
<p>
処理コマンドは TAB補完および上下(<code>M-p, M-n</code>)履歴表示が可能
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ショートカット</th>
<th scope="col" class="org-left">機能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c C-c</code></td>
<td class="org-left">文章全体を処理(※)</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-r</code></td>
<td class="org-left">選択したリージョンのみを処理(※)</td>
</tr>

<tr>
<td class="org-left"><code>C-c C-b</code></td>
<td class="org-left">現在のバッファのみを処理(※)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c '</code></td>
<td class="org-left">エラーを表示</td>
</tr>

<tr>
<td class="org-left"><code>C-x '</code></td>
<td class="org-left">次のエラーを表示</td>
</tr>

<tr>
<td class="org-left"><code>C-u C-x '</code></td>
<td class="org-left">前のエラーを表示</td>
</tr>
</tbody>
</table>

<p>
※長江研の設定では， <code>C-c C-c</code>, <code>C-c C-r</code>, <code>C-c C-b</code> に続く処理コマンドとして(デフォルトで実装されているものも含め)以下が用意されている：
</p>
<pre class="example">
BibTeX 	Biber 	Check 	Clean 	Clean All 	File 	Index
LaTeX 	Other 	Print 	Queue 	Spell 	View 	direct
dvipdfmx 	latexmk 	pBibTeX 	pLaTeX
</pre>
<p>
このうち，頻繁に使うのは以下のコマンドである．いずれもタブ補完が可能：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">コマンド</th>
<th scope="col" class="org-left">処理内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">pLaTeX</td>
<td class="org-left">pLaTeX を実行(.tex → .dvi)</td>
</tr>

<tr>
<td class="org-left">pBibTeX</td>
<td class="org-left">pBibTeX を実行(.aux ファイルを元に .bbl を生成)</td>
</tr>

<tr>
<td class="org-left">dvipdfmx</td>
<td class="org-left">dvipdfmx を実行(.dvi → .pdf)</td>
</tr>

<tr>
<td class="org-left">latexmk</td>
<td class="org-left">latexmk を実行(<code>~/.latexmkrc</code> で処理内容を設定可能)</td>
</tr>

<tr>
<td class="org-left">View</td>
<td class="org-left">(<code>open foo.pdf</code> などを呼び出せる)</td>
</tr>

<tr>
<td class="org-left">Other</td>
<td class="org-left">任意のコマンドを実行(e.g. <code>open -a Preview foo.pdf</code> などを呼び出せる)</td>
</tr>

<tr>
<td class="org-left">direct</td>
<td class="org-left">TeX ファイルを処理した後，PDF ファイルを開く(latexmk の後， <code>open -a Preview foo.pdf</code> を実行)</td>
</tr>

<tr>
<td class="org-left">Check</td>
<td class="org-left">lacheck による文法チェック</td>
</tr>

<tr>
<td class="org-left">Clean</td>
<td class="org-left">TeX 処理時に生成される中間ファイル(.aux, .toc, .log, .bbl など)を削除</td>
</tr>

<tr>
<td class="org-left">Clean All</td>
<td class="org-left">上記中間ファイルに加えて .dvi, .ps, .pdf などのファイルも削除</td>
</tr>

<tr>
<td class="org-left">Spell</td>
<td class="org-left">スペルチェック</td>
</tr>
</tbody>
</table>
</div></li></ul>
</div>
</div>
